Repository: pypi-data/pypi-mirror-377
Catalog: packages/djangocms-catalog-books/djangocms_catalog_books-2.0.1.tar.gz/djangocms_catalog_books-2.0.1/catalog_books/locale/*/LC_MESSAGES/django.po
Languages: cs

source: %(amount)s book.
cs: %(amount)s kniha

source: AAX was an audiobook format developed by Audible using an MPEG-4 container that also allowed for the file to be encrypted with DRM.
cs: AAX je formát audioknihy vyvinutý společností Audible s použitím kontejneru MPEG-4, který rovněž umožňuje zašifrování souboru pomocí DRM.

source: Add new Book
cs: Přidat novou knihu

source: Advanced options
cs: Pokročilá nastavení

source: An MP3 file is the most common lossy audio format, and though the quality is slightly diminished, vocals still come through without much loss.
cs: Soubor MP3 je nejběžnější ztrátový zvukový formát, a přestože je jeho kvalita mírně snížena, vokály jsou stále slyšet bez větších ztrát.

source: Apple Lossless Audio Codec (ALAC) is Apple's own file format for high-quality audio.
cs: Apple Lossless Audio Codec (ALAC) je vlastní formát souborů společnosti Apple pro vysoce kvalitní zvuk.

source: Audiobook
cs: Audiokniha

source: Author
cs: Autor

source: Authors
cs: Autoři

source: Authors and collective
cs: Autoři a kolektiv

source: Bibliographic data
cs: Bibliografické údaje

source: Bibliographic description
cs: Bibliografické údaje

source: Book
cs: Kniha

source: Book authors
cs: Autoři knih

source: Book categories
cs: Kategorie knih

source: Book detail
cs: Detail knihy

source: Book files in different formats.
cs: Soubory knihy v různých formátech.

source: Book formats
cs: Formáty knih

source: Book issue years
cs: Knihy rok vydání

source: Book licenses
cs: Licence knih

source: Book list
cs: Seznam knih

source: Book types
cs: Typ knih

source: Bookstore
cs: Knihkupectví

source: Bookstore name.
cs: Název knihkupectví.

source: Bookstores
cs: Knihkupectví

source: Button attribute title.
cs: Atribut tlačítka titulek.

source: Button text.
cs: Text tlačítka

source: Buy
cs: Koupit

source: Catalog of Books
cs: Katalog knih

source: Catalog of Books Menu
cs: Menu katalogu knih

source: Categories
cs: Kategorie

source: Category
cs: Kategorie

source: Class names separated by space.
cs: Jména tříd oddělená mezerou.

source: Coming soon
cs: Již brzy

source: Configuration
cs: Konfigurace

source: Configurations
cs: Konfigurace

source: Configure addon
cs: Konfigurovat addon

source: Css names
cs: Css jména

source: Delete this book
cs: Smazat tuto knihu

source: Description
cs: Popis

source: Detail CSS Class
cs: CSS třída detailu

source: Detail Thumbnail Height
cs: Výška náhledu v detailu

source: Detail Thumbnail Width
cs: Šířka náhledu v detailu

source: Dimensions
cs: Rozměry

source: Download
cs: Ke stažení

source: Download in format
cs: Stáhnout ve formátu

source: E-Book
cs: E-kniha

source: E-Books files
cs: Soubory s E-knihou.

source: EPUB (.epub) - An open eBook standard created by the International Digital Publishing Forum (IDPF). It features reflowable text, inline images and the ability to use Digital Rights Management (DRM) such as Adobe Digital Editions.
cs: EPUB (.epub) - Open eBook standard vytvořený společností International Digital Publishing Forum (IDPF). Formát poskytuje plovoucí text, vložené obrázky a možnost použití Digital Rights Management (DRM) tak jako je používá Adobe Digital Edice.

source: Edit this book
cs: Editovat tuto knihu

source: FLAC is largely considered to be the most superior form of lossless compressed audio.
cs: FLAC je většinou považován za nejdokonalejší formu bezeztrátové komprese zvuku.

source: First name
cs: Křestní jméno

source: Formats
cs: Formáty

source: Go to book detail.
cs: Jít na detail knihy.

source: Hide
cs: Skrýt

source: Hide this entry.
cs: Skrýt tento záznam.

source: Icon
cs: Ikona

source: Issue
cs: Vydáno

source: Issue year
cs: Rok vydání

source: Kindle (.azw) - Native format for Amazon's Kindle products which typically comes with DRM protection to limit sharing.
cs: Kindle (.azw) - Nativní formát pro Amazon Kindle produkty, obvykle s DRM ochranou na limit sdílení.

source: Kindle (.azw3) - Native format for Amazon's Kindle products which typically comes with DRM protection to limit sharing.
cs: Kindle (.azw3) - Nativní formát pro Amazon Kindle produkty, obvykle s DRM ochranou na limit sdílení.

source: LRF (.lrf) is an eBook reader file associated with Sony. It can contain text and images. It uses the DRM protection to ensure Sony's digital right. LRF files turn the data into binary file. LRF had been used for the eBooks of Sony eBook store before it was discontinued in 2010.
cs: LRF (.lrf) je soubor pro elektronickou knihu od Sony. Obsahuje text a obrázky. Používá DRM ochranu pro zajištění digitálních práv Sony. LRF soubory obsahují binární data. LRF bylo používáno pro el. knihy Sony do ukončení podpory v 2010.

source: Last name
cs: Příjmení

source: License
cs: Licence

source: Licenses
cs: Licence

source: List CSS Class
cs: CSS třída seznamu

source: List Group size
cs: Velikost skupiny seznamu

source: List Paginate size
cs: Velikost stránkování seznamu

source: List Thumbnail Height
cs: Výška náhledu v seznamu

source: List Thumbnail Width
cs: Šířka náhledu v seznamu

source: M4Ps are merely a version of AAC that have digital rights management included. It was originally built by Apple for the iTunes Music store.
cs: M4P jsou pouze verzí formátu AAC, která obsahuje správu digitálních práv. Původně ji vytvořila společnost Apple pro obchod iTunes Music.

source: MobiPocket (.mobi) - A format primarily designed for PDAs and older mobile devices. Also used on the Kindle.
cs: MobiPocket (.mobi) - Formát původně vytvořený pro PDA a starší mobilní zařízení. Lze také použít v Kindle.

source: More books by the same author
cs: Další knihy téhož autora

source: Name
cs: Název

# new-book
source: New
cs: Novinka

source: Next
cs: Další

source: No items available
cs: Nejsou k dispozici žádné položky

source: Number of items for group "Load more".
cs: Počet položek pro skupinu "Načíst další".

source: OEB (.oeb) is an XML based eBook file format. It is an open eBook Standard that can make order of the multiple sources and make the multiple sources into a single file. This file is DRM protected so the digital copyright of this book is available with this format. This format is used n online eBook stores.
cs: OEB (.oeb) je soubor elektronické knihy postavený na XML. Je to otevřený formát, který umí seskupit více zdrojů do jednoho souboru. Tento soubor má DRM ochranu, digitální copyright knihy je tedy v tomto formátu podporován. Formát je používán v online obchodech.

source: OGG is a sort of digital container that holds Vorbis files. Vorbis files are open source. It's also a superior form of audio quality and compression.
cs: OGG je druh digitálního kontejneru, který obsahuje soubory Vorbis. Soubory Vorbis mají otevřený zdrojový kód. Je to také vynikající forma kvality zvuku a komprese.

source: Only formats are allowed:
cs: Povolené jsou pouze formáty:

# imperative
source: Order by
cs: Řadit podle

source: PDF (.pdf) - A very popular eBook format from Adobe which most eReaders support.
cs: PDF (.pdf) - Velmi populární Adobe formát pro elektronické knihy podporovaný mnoha čtečkami.

source: Page of the bookstore selling this book.
cs: Stránka knihkupectví, na které prodávají tuto knihu.

source: Preview
cs: Náhled

source: Previous
cs: Předchozí

source: Sample
cs: Ukázka

source: Set extra css class.
cs: Nastavení vlastní css třídy.

source: Set extra css class. E.g. display-button-more.
cs: Nastavení vlastní css třídy. Např. display-button-more.

source: Slug for css class.
cs: Slug pro css třídu.

source: Submit button
cs: Tlačítko Odeslat

source: Text (.txt) - A basic plain text format which is easy to create, but cannot contain images.
cs: Text (.txt) - Základní jednoduchý textový formát, který je jednoduché vytvořit, ale neobsahuje obrázky.

source: The AAC format stands for Advanced Audio Coding, and it's actually a superior form of compression when compared to the MP3.
cs: Formát AAC znamená Advanced Audio Coding (pokročilé kódování zvuku) a ve srovnání s formátem MP3 se jedná o lepší formu komprese.

source: The compressed format used by Apple, just as the AAX is used by Audible, is the M4A or M4B.
cs: Komprimovaný formát používaný společností Apple, stejně jako formát AAX používaný společností Audible, je M4A nebo M4B.

source: Tiles CSS Class
cs: CSS třída dlaždic

source: Tiles Group size
cs: Velikost skupiny dlaždic

source: Tiles Paginate size
cs: Velikost stránkování dlaždic

source: Tiles Thumbnail Height
cs: Výška náhledu v dlaždicích

source: Tiles Thumbnail Width
cs: Šířka náhledu v dlaždicích

source: Title
cs: Nadpis

source: Total number of items on the page.
cs: Celkový počet položek na stránce.

source: Type
cs: Typ

source: URL to the page with book.
cs: URL na stránku s knihou.

source: Version
cs: Verze

source: WAV is one of the most popular files types for audio. It's an older format, but despite this, it is still widely used.
cs: WAV je jedním z nejoblíbenějších typů zvukových souborů. Je to starší formát, ale přesto se stále hojně používá.

source: WMA stands for Windows Media Audio, and there are both Lossy and Lossless formats for it.
cs: WMA je zkratka pro Windows Media Audio se strátovou nebo bezesetrátovou kompresí.

source: and team
cs: a kol.

source: by name A-Z
cs: podle názvu A-Z

source: by name Z-A
cs: podle názvu Z-A

source: e.g. 175 × 250 mm
cs: např. 175 × 250 mm

source: e.g. 1× book, paperback, 454 pages, Czech
cs: např. 1× kniha, brožovaná, 454 stran, česky

source: e.g. 978-80-88168-67-6
cs: např. 978-80-88168-67-6

source: e.g. Book cover.
cs: např. Obálka knihy.

source: from newest
cs: od nejnovějších

source: from oldest
cs: od nejstarších

source: list
cs: seznam

# books_on_bookstore
source: on
cs: na

source: tiles
cs: dlaždice

source: untitled
cs: nepojmenováno
