Repository: pypi-data/pypi-mirror-377
Catalog: packages/nr-vocabularies/nr_vocabularies-2.1.19-py3-none-any.whl/nr_vocabularies/translations/*/LC_MESSAGES/messages.po
Languages: cs

# vocabulary.access-rights
source: Access rights
cs: Přístupová práva

# vocabulary.contributor-roles
source: Contributor Type
cs: Role přispěvatele

# vocabulary.countries
source: Countries
cs: Státy

# vocabulary.funders
source: Research funders
cs: Poskytovatelé finanční podpory

# vocabulary.institutions
source: Institutions
cs: Instituce

# vocabulary.item-relation-types
source: The type of relationship of the described document to the interconnected item (unit)
cs: Typ vztahu popisovaného dokumentu k propojené jednotce

# vocabulary.languages
source: Languages
cs: Jazyky

# vocabulary.licenses
source: Licenses
cs: Licence

# vocabulary.resource-types
source: Resource type
cs: Typ zdroje

# vocabulary.subject-categories
source: Subject categories
cs: Oborové třídění

# vocabulary.relatedURI_COAR
source: COAR URL
cs: COAR uri

# vocabulary.dataCiteCode
source: Data Cite Code
cs: Data Cite

# vocabulary.alpha3Code
source: Alpha 3 Code
cs: Alpha 3 kód

# vocabulary.nonpreferredLabels_en
source: Alternative (non-preferred) label in English
cs: Alternativní (nepreferovaný) název anglicky

# vocabulary.relatedURI_CrossrefFunderID
source: CrossRef Funder ID
cs: Crossref ID poskytovatele podpory

# vocabulary.relatedURI_ROR
source: ROR url
cs: ROR uri

# vocabulary.contexts
source: Contexts
cs: Kontexty

# vocabulary.tags
source: Tags
cs: Značky

# vocabulary.ICO
source: Czech institution identification number
cs: IČO

# vocabulary.relatedURI_URL
source: Related URL
cs: URL odkazu

# vocabulary.nameType
source: Name Type
cs: Typ názvu

# vocabulary.nonpreferredLabels_cs
source: Alternative (non-preferred) label in Czech
cs: Alternativní (nepreferovaný) název česky

# vocabulary.pair
source: Pair
cs: Pár

# vocabulary.hint_en
source: Hint in English
cs: Nápověda anglicky

# vocabulary.hint_cs
source: Hint in Czech
cs: Nápověda česky

# vocabulary.alpha3CodeENG
source: Alpha 3 English Code
cs: Alpha 3 anglický kód

# vocabulary.alpha3CodeNative
source: Alpha 3 Native Code
cs: Alpha 3 nativní kód

# vocabulary.icon
source: Icon
cs: Ikona

# vocabulary.coarType
source: COAR Type
cs: COAR tip

# vocabulary.dataCiteType
source: Data Cite Type
cs: Data Cite typ
