Repository: pypi-data/pypi-mirror-377
Catalog: packages/collective.contact_behaviors/collective_contact_behaviors-1.0.0b5-py3-none-any.whl/collective/contact_behaviors/locales/*/LC_MESSAGES/collective.contact_behaviors.po
Languages: pt_br

source: Address Information
pt_br: Endereço

source: Behaviors: Catalog and querystring setup
pt_br: Behaviors:

source: Behaviors: Testing profile
pt_br: Behaviors: Perfil de testes

source: Behaviors: Uninstall
pt_br: Behaviors: Desinstalar

source: Configure collective.contact_behaviors
pt_br: Configurações para collective.contact_behaviors

source: Contact Information
pt_br: Informações de contato

source: Fields with address information
pt_br: Campos com informações de endereço

source: Fields with contact information
pt_br: Campos com informações de contato

source: Geography
pt_br: Geografia

source: Remove collective.contact_behaviors configuration
pt_br: Remove as configurações do collective.contact_behaviors

source: Used in automated tests, provides a new content type
pt_br: Utilizado para testes automatizados, provê um novo tipo de conteúdo

source: description_address_2
pt_br: Examplo: Sala 2

source: description_address_city
pt_br: Exemplo: Brasília

source: description_address_country
pt_br: Por favor, selecione o país

source: description_address_postal_code
pt_br: Exemplo: 70123

source: description_address_state
pt_br: Exemplo: DF

source: description_qs_country
pt_br: Filtrar por país

source: label_address
pt_br: Endereço

source: label_address_2
pt_br: Complemento

source: label_address_city
pt_br: Cidade

source: label_address_country
pt_br: País

source: label_address_info
pt_br: Endereço

source: label_address_postal_code
pt_br: CEP

source: label_address_state
pt_br: Estado

source: label_contact_info
pt_br: Informações de contato

source: label_contact_website
pt_br: Site

source: label_country
pt_br: País

source: label_fax
pt_br: Fax

source: label_office_phone
pt_br: Telefone escritório
