Repository: pypi-data/pypi-mirror-377
Catalog: packages/oarepo-doi/oarepo_doi-2.0.18.tar.gz/oarepo_doi-2.0.18/oarepo_doi/translations/*/LC_MESSAGES/messages.po
Languages: cs

source: Assign DOI
cs: Přidělit DOI

source: Request for DOI assignment
cs: Žádost o přidělení DOI

source: Request DOI assignment
cs: Žádost o přidělení DOI

source: Click to assign DOI.
cs: Kliknutím přidělíte DOI.

source: Request permission to assign DOI.
cs: Žádost o povolení pro přiřazení DOI.

source: Permission to assign DOI requested. You will be notified about the decision by email.
cs: Zažádáno o povolení pro přidělení DOI. O rozhodnutí budete informováni e-mailem.

source: You have been asked to approve the request to assign DOI to a record. You can approve or reject the request.
cs: Byli jste požádáni o schválení žádosti o přiřazení DOI k záznamu. Žádost můžete schválit nebo zamítnout.

source: Permission to assign DOI requested.
cs: Zažádáno o povolení k přidělení DOI.

source: Submit request to get permission to assign DOI.
cs: Podejte žádost o povolení k přidělení DOI.

source: DOI assignment requested
cs: Zažádáno o přidělení DOI

source: Cancel DOI registration
cs: Zrušit registraci DOI

source: Request for deletion of a registered DOI
cs: Žádost o vymazání registrovaného DOI

source: Request DOI cancellation
cs: Žádost o zrušení DOI

source: DOI cancellation requested
cs: Zažádáno o zrušení DOI

source: Click to cancel DOI registration.
cs: Kliknutím zrušíte registraci DOI.

source: Request permission to cancel DOI registration.
cs: Žádost o povolení zrušit registraci DOI.

source: Permission to cancel DOI registration requested. You will be notified about the decision by email.
cs: Žádost o povolení zrušit registraci DOI. O rozhodnutí budete informováni e-mailem.

source: You have been asked to approve the request to cancel DOI registration to a record. You can approve or reject the request.
cs: Byli jste požádáni o schválení žádosti o zrušení registrace DOI. Žádost můžete schválit nebo zamítnout.

source: Permission to cancel DOI registration requested.
cs: Žádost o povolení zrušit registraci DOI.

source: Submit request to get permission to cancel DOI registration.
cs: Podejte žádost o povolení zrušit registraci DOI.

source: Return for correction
cs: Vrátit k opravě

source: DOI assignment request for '{topic_title}' has been approved
cs: Žádost o přiřazení DOI pro záznam "{topic_title}" byla schválena

source: This is an auto-generated message. To manage notifications, visit your
cs: Toto je automaticky generovaná zpráva. Pokud tyto zprávy nechcete nadále dostávat, změňte si nastavení ve svém profilu.

source: account settings
cs: nastavení účtu

source: Your request to assign a DOI to the record "%(topic_title)s" has been approved. You can view the updated record at %(link)s
cs: Vaše žádost o přiřazení DOI k záznamu “%(topic_title)s” byla schválena. Aktualizovaný záznam si můžete prohlédnout na adrese %(link)s

source: Request for DOI assignment to record '{topic_title}' was declined
cs: Žádost o přiřazení DOI k záznamu ‚{topic_title}‘ byla zamítnuta.

source: <p> Request for assigning a DOI to the record "%(topic_title)s" was declined. You can see the request details at <a href="%(link)s">%(link)s</a> </p>
cs: <p> Žádost o přiřazení DOI k záznamu “%(topic_title)s” byla zamítnuta. Podrobnosti o žádosti naleznete na adrese <a href=“%(link)s”>%(link)s</a> </p>

source: Request for assigning a DOI to the record "%(topic_title)s" was declined. You can see the request details at %(link)s
cs: Žádost o přiřazení DOI k záznamu “%(topic_title)s” byla zamítnuta. Podrobnosti o žádosti naleznete na adrese %(link)s .

source: Request to assign DOI to record {topic_title}
cs: Žádost o přiřazení DOI k záznamu {topic_title}

source: You have been asked to approve a DOI assignment for the record "%(topic_title)s". Accept or Decline the request at %(link)s
cs: Byli jste požádáni o schválení přiřazení DOI pro záznam “%(topic_title)s”. Schvalte nebo zamítněte žádost na adrese %(link)s

source: DOI deletion request for '{topic_title}' has been approved
cs: Žádost o odstranění DOI pro ‚{topic_title}‘ byla schválena.

source: <p> Your request to delete the DOI from the record "%(topic_title)s" has been approved. You can view the updated record at <a href="%(link)s">%(link)s</a> </p>
cs: <p> Vaše žádost o odstranění DOI pro záznam “%(topic_title)s” byla schválena. Aktualizovaný záznam si můžete prohlédnout na adrese <a href=“%(link)s”>%(link)s</a> </p>

source: Your request to delete the DOI from the record "%(topic_title)s" has been approved. You can view the updated record at %(link)s
cs: Vaše žádost o odstranění DOI pro záznam “%(topic_title)s” byla schválena. Aktualizovaný záznam si můžete prohlédnout na adrese %(link)s

source: Request for DOI deletion from record '{topic_title}' was declined
cs: Žádost o odstranění DOI pro záznam ‚{topic_title}‘ byla zamítnuta.

source: <p> Request for deleting the DOI from the record "%(topic_title)s" was declined. You can see the request details at <a href="%(link)s">%(link)s</a> </p>
cs: <p> Žádost o odstranění DOI pro záznam “%(topic_title)s” byla zamítnuta. Podrobnosti o žádosti naleznete na adrese <a href=“%(link)s”>%(link)s</a> </p> .

source: Request for deleting the DOI from the record "%(topic_title)s" was declined. You can see the request details at %(link)s
cs: Žádost o vymazání DOI pro záznam “%(topic_title)s” byla zamítnuta. Podrobnosti o žádosti naleznete na adrese %(link)s .

source: Request to delete DOI from record {topic_title}
cs: Žádost o odstranění DOI pro záznam {topic_title}

source: <p> You have been asked to approve a DOI deletion for the record "%(topic_title)s". </p> <p> <a type="button" href='%(link)s'>Accept or Decline the request</a> </p>
cs: <p> Byli jste požádáni o schválení odstranění DOI pro záznam “%(topic_title)s”. </p> <p> <a type=“button” href=‘%(link)s’>Schválit nebo zamítnout žádost</a> </p>

source: You have been asked to approve a DOI deletion for the record "%(topic_title)s". Accept or Decline the request at %(link)s
cs: Byli jste požádáni o schválení odstranění DOI pro záznam “%(topic_title)s”. Schvalte nebo zamítněte žádost na adrese %(link)s .

source: <p> Your request to assign a DOI to the record "%(topic_title)s" has been approved. You can view the updated record at <a href="%(link)s">%(link)s</a> </p>
cs: <p> Vaše žádost o přidělení DOI záznamu "%(topic_title)s" byla schválena. Aktualizovaný záznam si můžete prohlédnout na adrese <a href="%(link)s">%(link)s</a> </p>

source: <p> You have been asked to approve a DOI assignment for the record "%(topic_title)s". </p> <p> <a type="button" href='%(link)s'>Accept or Decline the request</a> </p>
cs: <p> Byli jste požádáni o schválení přiřazení DOI pro záznam "%(topic_title)s". </p> <p> <a type="button" href='%(link)s'>Schválit nebo zamítnout žádost</a> </p>

source: This is an auto-generated message. To manage notifications, visit your account setting at: %(account_settings_link)s.
cs: Toto je automaticky generovaná zpráva. Pokud tyto zprávy nechcete nadále dostávat, změňte si nastavení ve svém profilu na %(account_settings_link)s.

source: Newest
cs: Nejnovější

source: Community slug
cs: Identifikátor komunity

source: Username
cs: Přihlašovací jméno

source: Password
cs: Heslo

source: Community
cs: Komunita

source: Created
cs: Vytvořeno

source: Updated
cs: Aktualizováno

source: DOI Configuration
cs: DOI Konfigurace

source: Create DOI configuration
cs: Vytvoření DOI konfigurace

source: Edit DOI configuration
cs: Editace DOI konfigurace

source: DOI configuration detail
cs: Detail DOI konfigurace

source: Community not found
cs: Komunita nenalezena
